# CurtainPanelHorizontalSpacing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..CurtainPanelHorizontalSpacing Property
Family Class See Also
---
For Curtain Panel families, the horizontal spacing of the driving mesh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double CurtainPanelHorizontalSpacing { get; set; }
```

Visual Basic
---
```text
Public Property CurtainPanelHorizontalSpacing As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CurtainPanelHorizontalSpacing {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if this family is not the owner family of a curtain panel family document. |

# See Also
Family Class
Autodesk.Revit.DB Namespace